Witali/yoRadio/esp8266/rtos-sdk-native/main/native_audio_output.c
#include "native_audio_output.h"

#include <stdbool.h>
#include <limits.h>
#include <stdlib.h>
#include <string.h>

#include "board_config.h"
#include "esp_attr.h"
#include "esp8266_nodac_i2s.h"
#include "spi_pdm_config.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "sdkconfig.h"
#if YORADIO_ESP8266_SPI_PDM
#include "driver/gpio.h"
#include "driver/spi.h"
#include "esp8266/eagle_soc.h"
#include "esp8266/spi_struct.h"
#include "rom/ets_sys.h"
#else
#include "driver/i2s.h"
#endif
#include "esp_log.h"
#include "native_audio_normalizer.h"
#include "persistent_settings.h"
#if CONFIG_YORADIO_AUDIO_OUTPUT_I2S_RCPDM
#include "rc_pdm.h"
#if YORADIO_ESP8266_OUTPUT_COMPARE
#include "rcpdm_variants.h"
#endif
_Static_assert(BOARD_I2S_PDM_OVERSAMPLE == RC_PDM_BITS_PER_SAMPLE,
               "I2S RCPDM requires exactly 32 bits per output PCM sample");
#endif

static const char *TAG = "audio_output";

#if defined(YORADIO_ESP8266_AUDIO_TRACE)
static unsigned s_output_pcm_trace_count;

static void trace_output_pcm(const int16_t *samples, size_t frames,
                             uint8_t channels) {
    if (s_output_pcm_trace_count >= 4U || !frames) return;
    int16_t minimum = INT16_MAX;
    int16_t maximum = INT16_MIN;
    uint32_t hash = 2166136261U;
    int16_t first[8] = {0};
    for (size_t frame = 0; frame < frames; ++frame) {
        int32_t mono = samples[frame * channels];
        if (channels == 2)
            mono = (mono + samples[frame * 2U + 1U]) / 2;
        int16_t value = (int16_t)mono;
        if (value < minimum) minimum = value;
        if (value > maximum) maximum = value;
        hash = (hash ^ (uint16_t)value) * 16777619U;
        if (frame < sizeof(first) / sizeof(first[0])) first[frame] = value;
    }
    if (s_output_pcm_trace_count && minimum == 0 && maximum == 0) return;
    ESP_LOGI(TAG,
             "AUDIO_TRACE OUTPUT-PCM cb=%u frames=%u min=%d max=%d "
             "fnv=%08x first=%d,%d,%d,%d,%d,%d,%d,%d",
             s_output_pcm_trace_count++, (unsigned)frames, minimum, maximum,
             (unsigned)hash, first[0], first[1], first[2], first[3],
             first[4], first[5], first[6], first[7]);
}
#endif
#if YORADIO_ESP8266_SPI_PDM
static uint32_t s_input_sample_rate;
static uint32_t s_resample_phase;
static uint32_t s_pdm_integrator;
static bool s_spi_initialized;
static bool s_spi_pin_selected;
#elif YORADIO_ESP8266_I2S_PDM
static uint32_t s_input_sample_rate;
static uint32_t s_resample_phase;
#if CONFIG_YORADIO_AUDIO_OUTPUT_I2S_RCPDM
static rc_pdm_t s_rcpdm;
#else
static uint32_t s_pdm_integrator;
#endif
static uint32_t s_i2s_pdm_partial_word;
static uint8_t s_i2s_pdm_partial_bits;
static bool s_i2s_started;
#else
static uint32_t s_sample_rate;
static bool s_i2s_started;
static bool s_clock_primed;
#endif
static uint8_t s_volume = 160;
static int8_t s_balance;
static bool s_normalization_enabled;
static uint8_t s_normalization_max_gain_db;
static int8_t s_normalization_target_db;
static uint16_t s_normalization_time_ms;

#define VOLUME_DENOMINATOR 254U
/* Signed: negating 16U wraps and clamps neutral balance to -16 (mute). */
#define BALANCE_DENOMINATOR 16
#define GAIN_Q15_ONE 32768U

#if !YORADIO_ESP8266_SPI_PDM && !YORADIO_ESP8266_I2S_PDM
/* The release/v3.4 RTOS I2S driver configures I2S and SLC but omits the
 * BBPLL audio-clock gate. ESP8266Audio enables this gate before touching the
 * peripheral; without it no DMA descriptor can ever complete. */
extern void rom_i2c_writeReg_Mask(int block, int host_id, int reg_add,
                                  int msb, int lsb, int value);

static void i2s_enable_bbpll_audio_clock(void) {
    rom_i2c_writeReg_Mask(0x67, 4, 4, 7, 7, 1);
}
#endif

static uint32_t channel_gain_q15(uint8_t volume, uint8_t balance_gain) {
    uint32_t denominator = VOLUME_DENOMINATOR * BALANCE_DENOMINATOR;
    uint32_t numerator = (uint32_t)volume * balance_gain;
    return (numerator * GAIN_Q15_ONE + denominator / 2U) / denominator;
}

static int16_t scale_sample(int16_t sample, uint32_t gain_q15) {
    int32_t value = (int32_t)sample * (int32_t)gain_q15;
    if (value >= 0) {
        value = (value + (int32_t)(GAIN_Q15_ONE / 2U)) >> 15;
    } else {
        value = -((-value + (int32_t)(GAIN_Q15_ONE / 2U)) >> 15);
    }
    if (value > INT16_MAX) value = INT16_MAX;
    if (value < INT16_MIN) value = INT16_MIN;
    return (int16_t)value;
}

#if YORADIO_ESP8266_SPI_PDM

#define SPI_PDM_CHUNK_BITS 512U
#define SPI_PDM_CHUNK_WORDS (SPI_PDM_CHUNK_BITS / 32U)
#define SPI_PDM_QUEUE_CHUNKS 12U
#define SPI_PDM_WAIT_MS 100U
#define SPI_PDM_GAP_STATS \
    (YORADIO_ESP8266_AUDIO_PROFILE || \
     YORADIO_ESP8266_AUDIO_OUTPUT_BENCHMARK)

typedef struct {
    uint32_t words[SPI_PDM_CHUNK_WORDS];
#if SPI_PDM_GAP_STATS
    uint32_t wire_cycles;
#endif
    uint16_t bit_count;
} spi_pdm_chunk_t;

static spi_pdm_chunk_t s_spi_queue[SPI_PDM_QUEUE_CHUNKS];
static volatile uint8_t s_spi_queue_head;
static volatile uint8_t s_spi_queue_tail;
static volatile uint8_t s_spi_queue_count;
static volatile bool s_spi_active;
static volatile TaskHandle_t s_spi_waiter;
static volatile bool s_spi_waiting;
#if SPI_PDM_GAP_STATS
static volatile uint32_t s_spi_last_start_cycle;
static volatile uint32_t s_spi_last_wire_cycles;
static volatile uint32_t s_spi_gap_cycles_total;
static volatile uint32_t s_spi_gap_cycles_max;
static volatile uint32_t s_spi_chained_transfers;
static volatile uint32_t s_spi_queue_empty_events;
#endif

#define DPORT_SPI_INT_STATUS_REG 0x3ff00020U
#define DPORT_SPI_INT_STATUS_SPI0 BIT4
#define DPORT_SPI_INT_STATUS_SPI1 BIT7

#if YORADIO_ESP8266_AUDIO_PROFILE
extern void audio_profile_spi_wait_begin(void);
extern void audio_profile_spi_wait_end(void);
#elif YORADIO_ESP8266_AUDIO_OUTPUT_BENCHMARK
extern void audio_output_benchmark_spi_wait_begin(void);
extern void audio_output_benchmark_spi_wait_end(void);
#endif

static const spi_interface_t s_spi_interface = {
    .cpol = 0,
    .cpha = 0,
    .bit_tx_order = 0,
    .bit_rx_order = 0,
    .byte_tx_order = 0,
    .byte_rx_order = 0,
    .mosi_en = 1,
    .miso_en = 0,
    .cs_en = 0,
};

#if SPI_PDM_GAP_STATS
extern uint64_t g_esp_os_cpu_clk;

static inline uint32_t IRAM_ATTR spi_pdm_cycle_clock(void) {
    uint32_t cycles;
    __asm__ __volatile__("rsr %0, ccount" : "=a"(cycles));
    /* ESP8266 RTOS SDK resets CCOUNT on every system tick. The accumulated
     * low word plus the live counter remains monotonic while this level-1 ISR
     * runs (and while the task-side caller holds its critical section). */
    return (uint32_t)g_esp_os_cpu_clk + cycles;
}
#endif

static inline void IRAM_ATTR spi_pdm_load_fifo(
    const spi_pdm_chunk_t *chunk) {
    if (chunk->bit_count == SPI_PDM_CHUNK_BITS) {
        for (unsigned index = 0; index < SPI_PDM_CHUNK_WORDS; ++index)
            SPI1.data_buf[index] = chunk->words[index];
        return;
    }
    unsigned words = (chunk->bit_count + 31U) / 32U;
    for (unsigned index = 0; index < words; ++index)
        SPI1.data_buf[index] = chunk->words[index];
}

static void IRAM_ATTR __attribute__((noinline)) spi_pdm_start_next_locked(void) {
    if (!s_spi_queue_count) {
#if SPI_PDM_GAP_STATS
        if (s_spi_active) ++s_spi_queue_empty_events;
#endif
        s_spi_active = false;
#if SPI_PDM_GAP_STATS
        s_spi_last_start_cycle = 0;
#endif
        return;
    }
#if SPI_PDM_GAP_STATS
    bool chained = s_spi_active && s_spi_last_start_cycle;
#endif
    const spi_pdm_chunk_t *chunk = &s_spi_queue[s_spi_queue_head];
    SPI1.user.usr_mosi = 1;
    SPI1.user.usr_mosi_highpart = 0;
    SPI1.user1.usr_mosi_bitlen = chunk->bit_count - 1U;
    spi_pdm_load_fifo(chunk);
    ++s_spi_queue_head;
    if (s_spi_queue_head == SPI_PDM_QUEUE_CHUNKS) s_spi_queue_head = 0;
    --s_spi_queue_count;
    s_spi_active = true;
#if SPI_PDM_GAP_STATS
    uint32_t now = spi_pdm_cycle_clock();
    if (chained) {
        uint32_t elapsed = now - s_spi_last_start_cycle;
        uint32_t gap = elapsed > s_spi_last_wire_cycles
            ? elapsed - s_spi_last_wire_cycles : 0;
        s_spi_gap_cycles_total += gap;
        if (gap > s_spi_gap_cycles_max) s_spi_gap_cycles_max = gap;
        ++s_spi_chained_transfers;
    }
    s_spi_last_start_cycle = now;
    s_spi_last_wire_cycles = chunk->wire_cycles;
#endif
    SPI1.cmd.usr = 1;
}

static void IRAM_ATTR __attribute__((noinline)) spi_pdm_wake_waiter(void) {
    BaseType_t higher_task_woken = pdFALSE;
    s_spi_waiting = false;
    TaskHandle_t waiter = s_spi_waiter;
    if (waiter) vTaskNotifyGiveFromISR(waiter, &higher_task_woken);
    if (higher_task_woken) portYIELD_FROM_ISR();
}

