Witali/yoRadio/esp8266/rtos-sdk-native/main/native_audio_output.c
    if (sample_rate != s_input_sample_rate) {
        s_input_sample_rate = sample_rate;
        s_resample_phase = 0;
    }
    spi_pdm_chunk_t *chunk = NULL;
    size_t bit_count = 0;
    for (size_t frame = 0; frame < frames; ++frame) {
        int32_t mono = samples[frame * channels];
        if (channels == 2)
            mono = (mono + samples[frame * 2U + 1U]) / 2;
        s_resample_phase += BOARD_SPI_PDM_SAMPLE_RATE;
        while (s_resample_phase >= sample_rate) {
            esp_err_t result = spi_pdm_emit_sample(
                (int16_t)mono, &chunk, &bit_count);
            if (result != ESP_OK) return result;
            s_resample_phase -= sample_rate;
        }
    }
    return bit_count ? spi_pdm_commit(chunk, bit_count) : ESP_OK;
}

void native_audio_output_silence(void) {
    if (!s_spi_initialized) return;
    esp_err_t result = spi_pdm_wait_idle();
    spi_pdm_chunk_t *silence = NULL;
    if (result == ESP_OK) result = spi_pdm_acquire(&silence);
    if (result == ESP_OK) {
        for (size_t index = 0; index < SPI_PDM_CHUNK_WORDS; ++index)
            silence->words[index] = 0xaaaaaaaaU;
        result = spi_pdm_commit(silence, SPI_PDM_CHUNK_BITS);
    }
    if (result == ESP_OK) result = spi_pdm_wait_idle();
    if (result != ESP_OK)
        ESP_LOGE(TAG, "SPI-PDM drain failed: %s", esp_err_to_name(result));
    taskENTER_CRITICAL();
    s_spi_queue_head = 0;
    s_spi_queue_tail = 0;
    s_spi_queue_count = 0;
    s_spi_active = false;
    s_spi_waiting = false;
    taskEXIT_CRITICAL();
    gpio_set_direction(BOARD_SPI_PDM_DATA_GPIO, GPIO_MODE_OUTPUT);
    gpio_set_level(BOARD_SPI_PDM_DATA_GPIO, 0);
    s_spi_pin_selected = false;
    s_input_sample_rate = 0;
    s_resample_phase = 0;
    s_pdm_integrator = 0;
}
#elif YORADIO_ESP8266_I2S_PDM

#define I2S_PDM_WRITE_TIMEOUT_MS 100U
#define I2S_PDM_SILENCE_WORD 0xaaaaaaaaU
#if CONFIG_YORADIO_AUDIO_OUTPUT_I2S_RCPDM
#define I2S_PDM_LOG_NAME "I2S RCPDM"
#else
#define I2S_PDM_LOG_NAME "I2S-PDM"
#endif

typedef struct {
    uint32_t *words;
    size_t word_count;
    size_t capacity;
    TickType_t deadline;
} i2s_pdm_writer_t;

static esp_err_t i2s_pdm_reserve(i2s_pdm_writer_t *writer) {
    TickType_t now = xTaskGetTickCount();
    if ((int32_t)(writer->deadline - now) <= 0) return ESP_ERR_TIMEOUT;
    esp_err_t result = esp8266_nodac_i2s_reserve(
        &writer->words, &writer->capacity, writer->deadline - now);
    if (result != ESP_OK)
        ESP_LOGE(TAG, I2S_PDM_LOG_NAME " DMA reserve failed: %s",
                 esp_err_to_name(result));
    return result;
}

static esp_err_t i2s_pdm_flush(i2s_pdm_writer_t *writer) {
    if (!writer->words) return ESP_OK;
    esp_err_t result = esp8266_nodac_i2s_commit(writer->word_count);
    if (result != ESP_OK) {
        /* Do not leave a loan outstanding on an error return. */
        (void)esp8266_nodac_i2s_commit(0);
        ESP_LOGE(TAG, I2S_PDM_LOG_NAME " DMA commit failed: %s",
                 esp_err_to_name(result));
    }
    writer->words = NULL;
    writer->word_count = writer->capacity = 0;
    return result;
}

static esp_err_t i2s_pdm_push_word(i2s_pdm_writer_t *writer, uint32_t word) {
    if (!writer->words) {
        esp_err_t result = i2s_pdm_reserve(writer);
        if (result != ESP_OK) return result;
    }
    writer->words[writer->word_count++] = word;
    return writer->word_count == writer->capacity
        ? i2s_pdm_flush(writer) : ESP_OK;
}

#if CONFIG_YORADIO_AUDIO_OUTPUT_I2S_RCPDM || CONFIG_YORADIO_I2S_PDM_OVERSAMPLE_32
#if BOARD_I2S_PDM_OVERSAMPLE != 32U || BOARD_I2S_PDM_REPEAT != 1U
#error "The optimized PDM32 packer requires 32 genuine bits per sample"
#endif

/* This packer runs in the audio task, not in the DMA ISR. Keep scarce IRAM
 * for decoder word workspaces; flash execution remains cache-backed. */
#if CONFIG_YORADIO_AUDIO_OUTPUT_I2S_RCPDM && !RCPDM_DISABLE_BATCH
static void __attribute__((noinline)) i2s_rcpdm_fill(
    uint32_t *words, const int16_t *pcm, size_t frames, unsigned channels) {
    rc_pdm_fill(&s_rcpdm, words, pcm, frames, channels);
}
#endif
static uint32_t __attribute__((noinline))
i2s_pdm_pack32(int16_t sample) {
#if CONFIG_YORADIO_AUDIO_OUTPUT_I2S_RCPDM
#ifdef RCPDM_TEST_SAMPLE
    return RCPDM_TEST_SAMPLE(&s_rcpdm, sample);
#else
    return rc_pdm_sample(&s_rcpdm, sample);
#endif
#else
    const uint32_t target = (uint32_t)((int32_t)sample - INT16_MIN);
    uint32_t integrator = s_pdm_integrator;
    uint32_t word = 0;
#define PDM32_STEP() do { \
        uint32_t sum = integrator + target; \
        integrator = sum & 0xffffU; \
        word = (word << 1) | (sum >> 16); \
    } while (0)
    PDM32_STEP(); PDM32_STEP(); PDM32_STEP(); PDM32_STEP();
    PDM32_STEP(); PDM32_STEP(); PDM32_STEP(); PDM32_STEP();
    PDM32_STEP(); PDM32_STEP(); PDM32_STEP(); PDM32_STEP();
    PDM32_STEP(); PDM32_STEP(); PDM32_STEP(); PDM32_STEP();
    PDM32_STEP(); PDM32_STEP(); PDM32_STEP(); PDM32_STEP();
    PDM32_STEP(); PDM32_STEP(); PDM32_STEP(); PDM32_STEP();
    PDM32_STEP(); PDM32_STEP(); PDM32_STEP(); PDM32_STEP();
    PDM32_STEP(); PDM32_STEP(); PDM32_STEP(); PDM32_STEP();
#undef PDM32_STEP
    s_pdm_integrator = integrator;
    return word;
#endif
}
#if YORADIO_ESP8266_OUTPUT_COMPARE
bool native_audio_output_benchmark_verify(void) {
#if CONFIG_YORADIO_AUDIO_OUTPUT_I2S_RCPDM
    const uint32_t seeds[] = {0, 1, 15, 0x80000000U, UINT32_MAX - 15U, UINT32_MAX};
    uint32_t saved = s_rcpdm.rc;
    unsigned cases = 0;
    rc_pdm_t expected;
    for (unsigned s = 0; s < sizeof(seeds) / sizeof(seeds[0]); ++s) {
        for (int32_t pcm = INT16_MIN; pcm <= INT16_MAX; ++pcm) {
            s_rcpdm.rc = expected.rc = seeds[s];
            uint32_t want = rc_candidate_original(&expected, (int16_t)pcm);
            uint32_t got = i2s_pdm_pack32((int16_t)pcm);
            if (want != got || expected.rc != s_rcpdm.rc) goto mismatch;
            if (!(++cases & 1023U)) vTaskDelay(1);
        }
    }
    s_rcpdm.rc = expected.rc = 0x80000000U;
    uint32_t random = 1;
    for (unsigned i = 0; i < 100000; ++i) {
        random = random * 1664525U + 1013904223U;
        int16_t pcm = (int16_t)((int32_t)(random & 65535U) - 32768);
        uint32_t want = rc_candidate_original(&expected, pcm);
        uint32_t got = i2s_pdm_pack32(pcm);
        if (want != got || expected.rc != s_rcpdm.rc) goto mismatch;
        if (!(++cases & 1023U)) vTaskDelay(1);
    }
    s_rcpdm.rc = saved;
    ESP_LOGI(TAG, "RCPDM bit-exact PASS: %u words and states", cases);
#if !RCPDM_DISABLE_BATCH
    // Exercise the actual machine-code batch writer before DMA/timing starts.
    int16_t pcm_batch[34];
    uint32_t words[17];
    unsigned batch_words = 0;
    for (unsigned channels = 1; channels <= 2; ++channels) {
        s_rcpdm.rc = expected.rc = 0x80000000U;
        for (unsigned block = 0; block < 128; ++block) {
            for (unsigned i = 0; i < 34; ++i) {
                random = random * 1664525U + 1013904223U;
                pcm_batch[i] = (int16_t)(random >> 16);
            }
            size_t count = block % 18U; // includes empty and partial spans
            i2s_rcpdm_fill(words, pcm_batch, count, channels);
            for (size_t i = 0; i < count; ++i) {
                int32_t mono = pcm_batch[i * channels];
                if (channels == 2) mono = (mono + pcm_batch[i * channels + 1]) / 2;
                if (words[i] != rc_candidate_original(&expected, (int16_t)mono)) goto mismatch;
                ++batch_words;
            }
            if (s_rcpdm.rc != expected.rc) goto mismatch;
        }
    }
    s_rcpdm.rc = saved;
    ESP_LOGI(TAG, "RCPDM batch bit-exact PASS: %u words, mono/stereo", batch_words);
#endif
    return true;
mismatch:
    ESP_LOGE(TAG, "RCPDM bit-exact FAIL after %u words", cases);
    s_rcpdm.rc = saved;
    return false;
#else
    return true;
#endif
}

