Witali/yoRadio/esp8266/rtos-sdk-native/main/native_audio_output.c
/* Diagnostic only: actual production packer, before I2S/DMA is initialized.
 * Count includes the common loop/checksum overhead; no writes or allocation. */
uint32_t native_audio_output_benchmark_pack32(const int16_t *pcm,
                                             size_t samples, unsigned repeats) {
#if CONFIG_YORADIO_AUDIO_OUTPUT_I2S_RCPDM
    rc_pdm_init(&s_rcpdm);
#else
    s_pdm_integrator = 0;
#endif
    uint32_t checksum = 0;
    for (unsigned repeat = 0; repeat < repeats; ++repeat)
        for (size_t i = 0; i < samples; ++i)
            checksum ^= i2s_pdm_pack32(pcm[i]);
    return checksum;
}
#endif
#else
static esp_err_t i2s_pdm_push_bit(i2s_pdm_writer_t *writer, bool high) {
    s_i2s_pdm_partial_word =
        (s_i2s_pdm_partial_word << 1) | (high ? 1U : 0U);
    ++s_i2s_pdm_partial_bits;
    if (s_i2s_pdm_partial_bits != 32U) return ESP_OK;

    uint32_t word = s_i2s_pdm_partial_word;
    s_i2s_pdm_partial_word = 0;
    s_i2s_pdm_partial_bits = 0;
    return i2s_pdm_push_word(writer, word);
}
#endif

static esp_err_t i2s_pdm_emit_sample(int16_t sample,
                                     i2s_pdm_writer_t *writer) {
#if CONFIG_YORADIO_AUDIO_OUTPUT_I2S_RCPDM || CONFIG_YORADIO_I2S_PDM_OVERSAMPLE_32
    return i2s_pdm_push_word(writer, i2s_pdm_pack32(sample));
#else
    const uint32_t target = (uint32_t)((int32_t)sample - INT16_MIN);
    for (unsigned bit = 0; bit < BOARD_I2S_PDM_OVERSAMPLE; ++bit) {
        s_pdm_integrator += target;
        bool high = s_pdm_integrator >= 65536U;
        if (high) s_pdm_integrator -= 65536U;
        for (unsigned repeat = 0; repeat < BOARD_I2S_PDM_REPEAT; ++repeat) {
            esp_err_t result = i2s_pdm_push_bit(writer, high);
            if (result != ESP_OK) return result;
        }
    }
    return ESP_OK;
#endif
}

static esp_err_t i2s_pdm_finish_partial_word(i2s_pdm_writer_t *writer) {
#if !CONFIG_YORADIO_AUDIO_OUTPUT_I2S_RCPDM && !CONFIG_YORADIO_I2S_PDM_OVERSAMPLE_32
    while (s_i2s_pdm_partial_bits) {
        esp_err_t result = i2s_pdm_emit_sample(0, writer);
        if (result != ESP_OK) return result;
    }
#endif
    return i2s_pdm_flush(writer);
}

static esp_err_t i2s_pdm_fill_dma_silence(void) {
    esp8266_nodac_i2s_silence(I2S_PDM_SILENCE_WORD);
    return ESP_OK;
}

esp_err_t native_audio_output_init(void) {
    esp_err_t result = esp8266_nodac_i2s_init(
        I2S_PDM_SILENCE_WORD, BOARD_I2S_PDM_BCK_DIV,
        BOARD_I2S_PDM_CLKM_DIV);
    if (result == ESP_OK) {
        s_i2s_started = true;
        s_input_sample_rate = 0;
        s_resample_phase = 0;
#if CONFIG_YORADIO_AUDIO_OUTPUT_I2S_RCPDM
        rc_pdm_init(&s_rcpdm);
#else
        s_pdm_integrator = 0;
#endif
        s_i2s_pdm_partial_word = 0;
        s_i2s_pdm_partial_bits = 0;
    }
    native_audio_output_reload_settings();
    if (result == ESP_OK) {
#if CONFIG_YORADIO_AUDIO_OUTPUT_I2S_RCPDM
        ESP_LOGI(TAG,
                 "I2S RCPDM DMA: mono GPIO%d/RX, carrier %u Hz, alpha=1/16; "
                 "%u x %u words; UART RX ignored",
                 BOARD_I2S_DATA_GPIO, BOARD_I2S_PDM_CARRIER_HZ,
                 ESP8266_NODAC_DMA_BUFFER_COUNT,
                 ESP8266_NODAC_DMA_BUFFER_WORDS);
#else
        ESP_LOGI(TAG,
                 "I2S-PDM DMA: mono GPIO%d/RX, carrier %u Hz, "
                 "PDM%u x%u effective %u Hz, nominal carrier %u Hz, "
                 "%u x %u words; UART RX ignored",
                 BOARD_I2S_DATA_GPIO, BOARD_I2S_PDM_CARRIER_HZ,
                 BOARD_I2S_PDM_OVERSAMPLE, BOARD_I2S_PDM_REPEAT,
                 BOARD_I2S_PDM_EFFECTIVE_HZ, BOARD_I2S_PDM_NOMINAL_HZ,
                 ESP8266_NODAC_DMA_BUFFER_COUNT,
                 ESP8266_NODAC_DMA_BUFFER_WORDS);
#endif
    }
    return result;
}

esp_err_t native_audio_output_write(int16_t *samples, size_t sample_count,
                                    uint32_t sample_rate, uint8_t channels) {
    if (!samples || !sample_count || !sample_rate ||
        (channels != 1 && channels != 2) || sample_count % channels)
        return ESP_ERR_INVALID_ARG;
    if (!s_i2s_started) return ESP_ERR_INVALID_STATE;

    size_t frames = sample_count / channels;
    native_audio_normalizer_configure(
        s_normalization_enabled, s_normalization_max_gain_db,
        s_normalization_target_db, s_normalization_time_ms, sample_rate);
    native_audio_normalizer_process(samples, frames, channels);
    /* Mono PDM has no independent L/R channels to balance. */
    uint8_t left_balance = channels == 2 && s_balance < 0
        ? (uint8_t)(BALANCE_DENOMINATOR + s_balance) : BALANCE_DENOMINATOR;
    uint8_t right_balance = channels == 2 && s_balance > 0
        ? (uint8_t)(BALANCE_DENOMINATOR - s_balance) : BALANCE_DENOMINATOR;
    uint32_t left_gain = channel_gain_q15(s_volume, left_balance);
    uint32_t right_gain = channel_gain_q15(s_volume, right_balance);
    for (size_t frame = 0; frame < frames; ++frame) {
        samples[frame * channels] =
            scale_sample(samples[frame * channels], left_gain);
        if (channels == 2) {
            samples[frame * 2U + 1U] =
                scale_sample(samples[frame * 2U + 1U], right_gain);
        }
    }
#if defined(YORADIO_ESP8266_AUDIO_TRACE)
    trace_output_pcm(samples, frames, channels);
#endif

    if (sample_rate != s_input_sample_rate) {
        s_input_sample_rate = sample_rate;
        s_resample_phase = 0;
    }
    i2s_pdm_writer_t writer = {
        .deadline = xTaskGetTickCount() +
                    pdMS_TO_TICKS(I2S_PDM_WRITE_TIMEOUT_MS),
    };
#if CONFIG_YORADIO_AUDIO_OUTPUT_I2S_RCPDM && !RCPDM_DISABLE_BATCH
    if (sample_rate == BOARD_I2S_PDM_SAMPLE_RATE && s_resample_phase == 0) {
        size_t frame = 0;
        while (frame < frames) {
            esp_err_t result = i2s_pdm_reserve(&writer);
            if (result != ESP_OK) {
                // Match the scalar path: it advances one sample before a
                // failed reserve and leaves the resampler subtraction pending.
                int32_t mono = samples[frame * channels];
                if (channels == 2) mono = (mono + samples[frame * 2U + 1U]) / 2;
                (void)i2s_pdm_pack32((int16_t)mono);
                s_resample_phase = BOARD_I2S_PDM_SAMPLE_RATE;
                return result;
            }
            size_t count = frames - frame;
            if (count > writer.capacity) count = writer.capacity;
            i2s_rcpdm_fill(writer.words, samples + frame * channels, count, channels);
            writer.word_count = count;
            frame += count;
            bool full = count == writer.capacity;
            result = i2s_pdm_flush(&writer);
            if (result != ESP_OK) {
                if (full) s_resample_phase = BOARD_I2S_PDM_SAMPLE_RATE;
                return result;
            }
        }
        return ESP_OK;
    }
#endif
    for (size_t frame = 0; frame < frames; ++frame) {
        int32_t mono = samples[frame * channels];
        if (channels == 2)
            mono = (mono + samples[frame * 2U + 1U]) / 2;
        s_resample_phase += BOARD_I2S_PDM_SAMPLE_RATE;
        while (s_resample_phase >= sample_rate) {
            esp_err_t result =
                i2s_pdm_emit_sample((int16_t)mono, &writer);
            if (result != ESP_OK) return result;
            s_resample_phase -= sample_rate;
        }
    }
    return i2s_pdm_flush(&writer);
}

void native_audio_output_silence(void) {
    if (!s_i2s_started) return;
    i2s_pdm_writer_t writer = {
        .deadline = xTaskGetTickCount() +
                    pdMS_TO_TICKS(I2S_PDM_WRITE_TIMEOUT_MS),
    };
    esp_err_t result = i2s_pdm_finish_partial_word(&writer);
    if (result == ESP_OK) result = i2s_pdm_fill_dma_silence();
    if (result != ESP_OK)
        ESP_LOGE(TAG, I2S_PDM_LOG_NAME " silence failed: %s", esp_err_to_name(result));
    s_input_sample_rate = 0;
    s_resample_phase = 0;
#if CONFIG_YORADIO_AUDIO_OUTPUT_I2S_RCPDM
    rc_pdm_init(&s_rcpdm);
#else
    s_pdm_integrator = 0;
#endif
    s_i2s_pdm_partial_word = 0;
    s_i2s_pdm_partial_bits = 0;
}

#else

esp_err_t native_audio_output_init(void) {
    const i2s_config_t config = {
        .mode = I2S_MODE_MASTER | I2S_MODE_TX,
        .sample_rate = 44100,
        .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
        .channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT,
        .communication_format = I2S_COMM_FORMAT_I2S | I2S_COMM_FORMAT_I2S_MSB,
        .dma_buf_count = 4,
        .dma_buf_len = 128,
        .tx_desc_auto_clear = true,
    };
    const i2s_pin_config_t pins = {
        .bck_o_en = 1,
        .ws_o_en = 1,
        .data_out_en = 1,
        .data_in_en = 0,
    };
    i2s_enable_bbpll_audio_clock();
    esp_err_t result = i2s_driver_install(I2S_NUM_0, &config, 0, NULL);
    if (result == ESP_OK) result = i2s_set_pin(I2S_NUM_0, &pins);
    if (result == ESP_OK)
        result = i2s_set_clk(I2S_NUM_0, 44100,
                             I2S_BITS_PER_SAMPLE_16BIT,
                             I2S_CHANNEL_STEREO);
    if (result == ESP_OK) {
        /* Keep SLC DMA active between streams. The legacy ESP8266 driver
         * reports a stopped-DMA write timeout as ESP_OK with zero bytes, so
         * silence is written into the existing descriptors instead. */
        s_sample_rate = 44100;
        s_i2s_started = true;
        s_clock_primed = false;
        result = i2s_zero_dma_buffer(I2S_NUM_0);
    }
    native_audio_output_reload_settings();
    ESP_LOGI(TAG, "I2S DMA: 4 x 128 stereo frames");
    return result;
}

esp_err_t native_audio_output_write(int16_t *samples, size_t sample_count,
                                    uint32_t sample_rate, uint8_t channels) {
    if (!samples || !sample_count || !sample_rate ||
        (channels != 1 && channels != 2)) return ESP_ERR_INVALID_ARG;
    size_t frames = sample_count / channels;
    native_audio_normalizer_configure(
        s_normalization_enabled, s_normalization_max_gain_db,
        s_normalization_target_db, s_normalization_time_ms, sample_rate);
    native_audio_normalizer_process(samples, frames, channels);
    /* Balance only applies when the decoder supplies independent L/R. */
    uint8_t left_balance = channels == 2 && s_balance < 0
        ? (uint8_t)(BALANCE_DENOMINATOR + s_balance) : BALANCE_DENOMINATOR;
    uint8_t right_balance = channels == 2 && s_balance > 0
        ? (uint8_t)(BALANCE_DENOMINATOR - s_balance) : BALANCE_DENOMINATOR;
    uint32_t left_gain = channel_gain_q15(s_volume, left_balance);
    uint32_t right_gain = channel_gain_q15(s_volume, right_balance);
    for (size_t frame = 0; frame < frames; ++frame) {
        samples[frame * channels] =
            scale_sample(samples[frame * channels], left_gain);
        if (channels == 2) {
            samples[frame * 2U + 1U] =
                scale_sample(samples[frame * 2U + 1U], right_gain);
        }
    }
    if (channels == 1) {
        if (sample_count > 1152) return ESP_ERR_INVALID_SIZE;
        for (size_t index = sample_count; index-- > 0;) {
            int16_t value = samples[index];
            samples[index * 2] = value;
            samples[index * 2 + 1] = value;
        }
        sample_count *= 2;
    }
    if (!s_clock_primed || sample_rate != s_sample_rate) {
        esp_err_t result = i2s_set_clk(I2S_NUM_0, sample_rate,
                                       I2S_BITS_PER_SAMPLE_16BIT,
                                       I2S_CHANNEL_STEREO);
        if (result != ESP_OK) return result;
        s_sample_rate = sample_rate;
        s_clock_primed = true;
    }
    size_t bytes = sample_count * sizeof(*samples);
    if (!s_i2s_started) {
        esp_err_t result = i2s_start(I2S_NUM_0);
        if (result != ESP_OK) return result;
        s_i2s_started = true;
    }

    size_t offset = 0;
    while (offset < bytes) {
        size_t bytes_written = 0;
        esp_err_t result = i2s_write(
            I2S_NUM_0, (uint8_t *)samples + offset, bytes - offset,
            &bytes_written, pdMS_TO_TICKS(1000));
        if (result != ESP_OK || !bytes_written) {
            ESP_LOGE(TAG, "I2S write failed: %s, %u/%u bytes",
                     esp_err_to_name(result), (unsigned)offset,
                     (unsigned)bytes);
            return result == ESP_OK ? ESP_FAIL : result;
        }
        offset += bytes_written;
    }
    return ESP_OK;
}

void native_audio_output_silence(void) {
    if (!s_i2s_started) return;
    esp_err_t result = i2s_zero_dma_buffer(I2S_NUM_0);
    if (result != ESP_OK)
        ESP_LOGE(TAG, "I2S silence failed: %s", esp_err_to_name(result));
    s_clock_primed = false;
}

#endif

